feijie825/gonghao/LM3S21xx_can.c
}
/*****************************************************************************
* 清除CAN 报文中断状态位
* 入口:CANx CAN结构体
* 入口:ulIntClr 清除中断状态位选择
* ulIntClr= CAN_INT_INTID_STATUS 清除状态中断
* ulIntClr= 1~32 清除报文中断状态
* 2011.3.22 zlz 将清除中断端口用1(中断中) 防止与CAN_Tx_Msg()程序中使用端口冲突
*****************************************************************************/
void CANIntClear(CAN_Typedef *CANx, u32 ulIntClr)
{
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((ulIntClr == CAN_INT_INTID_STATUS) ||
           ((ulIntClr>=1) && (ulIntClr <=32)));
    if(ulIntClr == CAN_INT_INTID_STATUS)
     CANRegRead(IntNumber,(u32)&CANx->STS);
    else
     {
      while(CANRegRead(IntNumber,(u32)&CANx->INF[1].CRQ) & CAN_IF1CRQ_BUSY)
       {              //等待接口寄存器空闲
       }
      CANRegWrite((u32)&CANx->INF[1].CMSK , CAN_IF1CMSK_CLRINTPND);         //访问报文CLRINTPND位
      CANRegWrite((u32)&CANx->INF[1].CRQ , (ulIntClr & CAN_IF1CRQ_MNUM_M)); //设置要访问的报文
      while(CANRegRead(IntNumber,(u32)&CANx->INF[1].CRQ) & CAN_IF1CRQ_BUSY)
       {
       }
     }
}
/*****************************************************************************
* 设置CAN禁止自动重发位
* 入口:CANx CAN结构体
* 入口:bAutoRetry=1 使能自动重发 bAutoRetry=0禁能自动重发
*****************************************************************************/
void CANRetrySet(CAN_Typedef *CANx, u8 bAutoRetry)
{
    u32 ulCtlReg;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ulCtlReg = CANRegRead(IntNumber,(u32)&CANx->CTL);
    if(bAutoRetry)
     ulCtlReg &= ~CAN_CTL_DAR;               //允许自动重发
    else
     ulCtlReg |= CAN_CTL_DAR;                //禁止自动重发    
    CANRegWrite((u32)&CANx->CTL , ulCtlReg); //写控制寄存器
}

/*****************************************************************************
* 获取CAN自动重发状态
* 入口:CANx CAN结构体
* 返回 true 自动重发使能 false自动重发禁能
*****************************************************************************/
u8 CANRetryGet(CAN_Typedef *CANx)
{
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));

    if(CANRegRead(IntNumber,(u32)&CANx->CTL) & CAN_CTL_DAR)
     return(false);
    return(true);
}
/*****************************************************************************
* 获取CAN 中断状态
* 入口:CANx CAN结构体
* 入口:eStatusReg 需要获取状态位的类型 CAN_STS_CONTROL...
*****************************************************************************/
u32	CANStatusGet(CAN_Typedef *CANx, CANSts eStatusReg)
{
    u32 ulStatus;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    switch(eStatusReg)
     {
      case CAN_STS_CONTROL:
       {                 //读取系统状态寄存器 同时清除状态位
        ulStatus = CANRegRead(IntNumber,(u32)&CANx->STS);
        CANRegWrite((u32)&CANx->STS , (~(CAN_STS_RXOK | CAN_STS_TXOK | CAN_STS_LEC_M)));
        return(ulStatus);
       }
      case CAN_STS_TXREQUEST:
       {                 //读取发送请求状态
        ulStatus = CANRegRead(IntNumber,(u32)&CANx->TXRQ1);
        ulStatus |= CANRegRead(IntNumber,(u32)&CANx->TXRQ2) << 16;
        return(ulStatus);
       }
      case CAN_STS_NEWDAT:
       {                 //读取新数据接收状态
        ulStatus = CANRegRead(IntNumber,(u32)&CANx->NWDA1);
        ulStatus |= CANRegRead(IntNumber,(u32)&CANx->NWDA2) << 16;
        return(ulStatus);
       }
      case CAN_STS_MSGVAL:
       {                 //读取报文RAM有效状态
        ulStatus = CANRegRead(IntNumber,(u32)&CANx->MSG1VAL);
        ulStatus |= CANRegRead(IntNumber,(u32)&CANx->MSG2VAL) << 16;
        return(ulStatus);
       }
      default:
       return(0);       //非法 返回0
     }
}

/*****************************************************************************
* 获取CAN 错误计数值
* 入口:CANx CAN结构体
* 人口*CanErr_Cnt 错误计数返回指针
* 出口:true 达到错误认可门限 false未达到
*****************************************************************************/
u8 CANErrCntrGet(CAN_Typedef *CANx, u16 *CanErr_Cnt)
{
    u32 ulCANError;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ulCANError = CANRegRead(IntNumber,(u32)&CANx->ERR); //读错误计数寄存器
    *CanErr_Cnt = (ulCANError &(CAN_ERR_REC_M|CAN_ERR_TEC_M));  //错误计数
    if(ulCANError & CAN_ERR_RP)                         //判断是否达到错误认可门限
     return(true);
    return(false);
}

/*****************************************************************************
* 设置 CAN 接收报文RAM 区 报文对象
* 入口:CANx CAN结构体
* 入口: CAN_MSG 报文指针 
* 入口: eMsgType 报文类型
* 关闭接收到远程帧自动回送功能 ZLZ 2008.11.27
*****************************************************************************/
void CAN_RxMsg_Set(CAN_Typedef *CANx, CAN_MSG_SET *CAN_MSG, MsgType eMsgType)
{
    u16 usCmdMaskReg;
    u16 usMaskReg[2]={0,0};
    u16 usArbReg[2]={0,0};
    u16 usMsgCtrl=0;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((CAN_MSG->CTL.BIT.IDx <= 32) && (CAN_MSG->CTL.BIT.IDx != 0));
    ASSERT((eMsgType == MSG_OBJ_TYPE_RX) ||
           (eMsgType == MSG_OBJ_TYPE_RX_REMOTE) ||
           (eMsgType == MSG_OBJ_TYPE_TX_REMOTE) ||)
    while(CANRegRead(IntNumber,(u32)&CANx->INF[0].CRQ) & CAN_IF1CRQ_BUSY)
     {                                    //等待接口寄存器空闲
     }

    usCmdMaskReg = (CAN_IF1CMSK_WRNRD |   //方向 INF->MSG RAM
                    CAN_IF1CMSK_DATAA |   //允许访问MSG 数据A
                    CAN_IF1CMSK_DATAB |   //允许访问MSG 数据B
                    CAN_IF1CMSK_CONTROL|  //允许访问MSG 控制位
					CAN_IF1CMSK_ARB);     //允许访问MSG 仲裁位
    switch(eMsgType)
     {                    //根据报文类型跳转
         case MSG_OBJ_TYPE_RX:
          {                //接收数据帧
           usArbReg[1] = 0;//设置方向位为接收数据帧
           break;
          }
         case MSG_OBJ_TYPE_RX_REMOTE:
          {                //接收远程帧
           usArbReg[1] = CAN_IF1ARB2_DIR;    //设置方向位为接收远程帧
           usMsgCtrl   = CAN_IF1MCTL_UMASK;  //访问屏蔽位
           usMaskReg[0] = 0xffff;            //远程帧默认ID过滤使能
           usMaskReg[1] = 0x1fff;            //远程帧默认ID过滤使能
           usCmdMaskReg |= CAN_IF1CMSK_MASK; //访问仲裁位
           break;
          }
         case MSG_OBJ_TYPE_RXTX_REMOTE:
          {                //接收远程帧后自动回送
           usArbReg[1] = CAN_IF1ARB2_DIR;
           usMsgCtrl = CAN_IF1MCTL_RMTEN | CAN_IF1MCTL_UMASK;
           break;
          }
         default:
          return;              //非法 退出
     }
     if(CAN_MSG->CTL.BIT.ID_FLT_EN )//判断是否使用ID过滤屏蔽
      {                        //使用ID过滤屏蔽
       if(CAN_MSG->CTL.BIT.EXD_ID)
        {                      //扩展帧	29bit ID
          usMaskReg[0] = CAN_MSG->IDMask.WORD & CAN_IF1MSK1_IDMSK_M;
          usMaskReg[1] = ((CAN_MSG->IDMask.WORD >> 16) & CAN_IF1MSK2_IDMSK_M);
        }
       else
        {                      //标准帧  
         usMaskReg[0] = 0;
         usMaskReg[1] = ((CAN_MSG->IDMask.WORD >> 6 ) & CAN_IF1MSK2_IDMSK_M);
        }
      }
    if(CAN_MSG->CTL.BIT.ID_FLT_EN && CAN_MSG->CTL.BIT.EXT_FLT_EN)
     usMaskReg[1] |= CAN_IF1MSK2_MXTD;  //使用扩展ID过滤
    if(CAN_MSG->CTL.BIT.ID_FLT_EN && CAN_MSG->CTL.BIT.DIR_FLT_EN)
     usMaskReg[1] |= CAN_IF1MSK2_MDIR;  //传输方向用于过滤
    if(CAN_MSG->CTL.BIT.ID_FLT_EN  ||
       CAN_MSG->CTL.BIT.EXT_FLT_EN ||
       CAN_MSG->CTL.BIT.DIR_FLT_EN)
     {
      usMsgCtrl |= CAN_IF1MCTL_UMASK;
      usCmdMaskReg |= CAN_IF1CMSK_MASK;
     }
    if(CAN_MSG->CTL.BIT.EXD_ID)
     {                     //扩展帧 29BIT ID
      usArbReg[0] |= CAN_MSG->ID.WORD & CAN_IF1ARB1_ID_M;
      usArbReg[1] |= (CAN_MSG->ID.WORD >> 16) & CAN_IF1ARB2_ID_M;
      usArbReg[1] |= CAN_IF1ARB2_MSGVAL | CAN_IF1ARB2_XTD;
     }
    else
     {                      //标准帧
      usArbReg[1] |= (CAN_MSG->ID.WORD >> 6) & CAN_IF1ARB2_ID_M;
      usArbReg[1] |= CAN_IF1ARB2_MSGVAL;
     }
    usMsgCtrl |= (CAN_MSG->CTL.BIT.LEN  | CAN_IF1MCTL_EOB); //设置控制位 数据长度 单次发送
    if(CAN_MSG->CTL.BIT.RX_INT_EN )                       //判断接收中断是否使能
     usMsgCtrl |= CAN_IF1MCTL_RXIE;                       //接收中断使能        
    CANRegWrite((u32)&CANx->INF[0].CMSK , usCmdMaskReg);  //写命令屏蔽寄存器
    CANRegWrite((u32)&CANx->INF[0].MSK1 , usMaskReg[0]);  //写屏蔽寄存器1
    CANRegWrite((u32)&CANx->INF[0].MSK2 , usMaskReg[1]);  //写屏蔽寄存器2
    CANRegWrite((u32)&CANx->INF[0].ARB1 , usArbReg[0]);   //写仲裁寄存器1
    CANRegWrite((u32)&CANx->INF[0].ARB2 , usArbReg[1]);   //写仲裁寄存器2
    CANRegWrite((u32)&CANx->INF[0].MCTL , usMsgCtrl);     //写报文控制寄存器
    CANRegWrite((u32)&CANx->INF[0].CRQ , (CAN_MSG->CTL.BIT.IDx & CAN_IF1CRQ_MNUM_M));//INF->MSG RAM
}
/*****************************************************************************
* 设置 CAN 报文RAM 区 报文对象
* 入口:CANx CAN结构体
* 入口: CAN_MSG 报文指针 
* 入口: eMsgType 报文类型 MSG_OBJ_TYPE_TX  MSG_OBJ_TYPE_TX_REMOTE
* 2008.12.5 为提高处理速度 去掉远程帧发送 如果需要发送远程帧 要修改程序
*****************************************************************************/
void CAN_Tx_Msg(CAN_Typedef *CANx, CAN_MSG *CAN_MSG, MsgType eMsgType)
{
    u16 usCmdMaskReg;
    u16 usArbReg[2]={0,0};
    u16 usMsgCtrl=0;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((CAN_MSG->CTL.BIT.IDx <= 32) && (CAN_MSG->CTL.BIT.IDx != 0));
    ASSERT((eMsgType == MSG_OBJ_TYPE_TX) ||
           (eMsgType == MSG_OBJ_TYPE_TX_REMOTE))
    
    while(CANRegRead(IntNumber,(u32)&CANx->INF[0].CRQ) & CAN_IF1CRQ_BUSY)
     {        //等待接口寄存器空闲
     }

    usCmdMaskReg = (CAN_IF1CMSK_WRNRD |   //方向 INF->MSG RAM
                    CAN_IF1CMSK_DATAA |   //允许访问MSG 数据A
                    CAN_IF1CMSK_DATAB |   //允许访问MSG 数据B
                    CAN_IF1CMSK_CONTROL|  //允许访问MSG 控制位
                    CAN_IF1CMSK_ARB);     //允许访问MSG 仲裁位 
    if(eMsgType != MSG_OBJ_TYPE_TX)
     return;
    usArbReg[1] = (CAN_IF1ARB2_DIR|CAN_IF1ARB2_MSGVAL);    //设置方向位为发送 发送数据帧
    usMsgCtrl = (CAN_IF1MCTL_TXRQST| CAN_IF1MCTL_EOB);     //置位发送请求  发送数据帧
    usMsgCtrl |= CAN_MSG->CTL.BIT.LEN  ;                   //设置控制位 数据长度 单次发送
    if(CAN_MSG->CTL.BIT.TX_INT_EN )                        //判断发送中断是否使能
     usMsgCtrl |= CAN_IF1MCTL_TXIE;                        //发送中断使能
    if(CAN_MSG->CTL.BIT.EXD_ID)
     {                     //扩展帧 29BIT ID
      usArbReg[0]  = CAN_MSG->ID.WORD & CAN_IF1ARB1_ID_M;
      usArbReg[1] |= (CAN_MSG->ID.WORD >> 16) & CAN_IF1ARB2_ID_M;
      usArbReg[1] |= CAN_IF1ARB2_XTD;
     }
    else
     {                      //标准帧
      usArbReg[0] = 0;
      usArbReg[1] |= (CAN_MSG->ID.WORD >> 6) & CAN_IF1ARB2_ID_M;
     }
    if(CAN_MSG->CTL.BIT.LEN!=0)
     {                                         //数据帧 数据长度不为0导入数据
      CANDataRegWrite(&CAN_MSG->Data.BYTE[0],  //待发送数据指针
                     (u32)&CANx->INF[0].DA1,   //CAN数据寄存器地址
                     CAN_MSG->CTL.BIT.LEN);    //数据长度)
     }
    CANRegWrite((u32)&CANx->INF[0].CMSK , usCmdMaskReg);  //写命令屏蔽寄存器
    CANRegWrite((u32)&CANx->INF[0].ARB1 , usArbReg[0]);   //写仲裁寄存器1
    CANRegWrite((u32)&CANx->INF[0].ARB2 , usArbReg[1]);   //写仲裁寄存器2
    CANRegWrite((u32)&CANx->INF[0].MCTL , usMsgCtrl);     //写报文控制寄存器
    CANRegWrite((u32)&CANx->INF[0].CRQ , (CAN_MSG->CTL.BIT.IDx & CAN_IF1CRQ_MNUM_M));//INF->MSG RAM
}
/*****************************************************************************
* 读取 CAN 报文RAM 区 报文对象
* 入口:CANx CAN结构体
* 入口: CAN_MSG 报文指针
* 入口: bClrPendingInt 是否清除挂起位
* 2008.11.27 zlz 取消了屏蔽码读取 不接收远程帧 
*****************************************************************************/
void CAN_Rx_Msg(CAN_Typedef *CANx, CAN_MSG *CAN_MSG, u8 bClrPendingInt)
{
    u16 usCmdMaskReg;
    u16 usArbReg[2]={0,0};
    u16 usMsgCtrl=0;
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((CAN_MSG->CTL.BIT.IDx <= 32) && (CAN_MSG->CTL.BIT.IDx != 0));
    usCmdMaskReg = (CAN_IF1CMSK_DATAA |   //允许访问DA
                    CAN_IF1CMSK_DATAB |   //允许访问DB
                    CAN_IF1CMSK_CONTROL | //访问控制位
                    CAN_IF1CMSK_MASK |    //访问屏蔽位
                    CAN_IF1CMSK_ARB|      //访问仲裁位
                    CAN_IF1CMSK_NEWDAT);  //清除新数据标志
    if(bClrPendingInt)                    //判断是否清除pending位
     usCmdMaskReg |= CAN_IF1CMSK_CLRINTPND;//清除
    CANRegWrite((u32)&CANx->INF[1].CMSK , usCmdMaskReg); //写命令屏蔽寄存器
    CANRegWrite((u32)&CANx->INF[1].CRQ , (CAN_MSG->CTL.BIT.IDx & CAN_IF1CRQ_MNUM_M)); //MSG RAM->INF
    while(CANRegRead(IntNumber,(u32)&CANx->INF[1].CRQ) & CAN_IF1CRQ_BUSY)
     {                                     //等待 MSG RAM->INF 完成
     }
    usArbReg[0]  = CANRegRead(IntNumber,(u32)&CANx->INF[1].ARB1); //读仲裁寄存器1
    usArbReg[1]  = CANRegRead(IntNumber,(u32)&CANx->INF[1].ARB2); //读仲裁寄存器2
    usMsgCtrl    = CANRegRead(IntNumber,(u32)&CANx->INF[1].MCTL); //读报文控制寄存器
/*
    CAN_MSG->CTL.WORD = MSG_OBJ_NO_FLAGS;//清除报文标志 
    if((!(usMsgCtrl & CAN_IF1MCTL_TXRQST) && (usArbReg[1] & CAN_IF1ARB2_DIR))
     || ((usMsgCtrl & CAN_IF1MCTL_TXRQST) && (!(usArbReg[1] & CAN_IF1ARB2_DIR))))
     CAN_MSG->CTL.BIT.RMT_FRM = 1;       //远程帧标志
*/
    if(usArbReg[1] & CAN_IF1ARB2_XTD)
     {                                 //扩展帧
      CAN_MSG->ID.WORD = (((usArbReg[1] & CAN_IF1ARB2_ID_M) << 16) | usArbReg[0]);//ID
      CAN_MSG->CTL.BIT.EXD_ID = 1;  //控制域中扩展帧标志
     }
    else							   //标准帧
     CAN_MSG->ID.WORD = (usArbReg[1] & CAN_IF1ARB2_ID_M) << 6;//ID
/* 2008.12.5 zlz 为提高处理速度去掉
    if(usMsgCtrl & CAN_IF1MCTL_MSGLST)             //判断是否有报文丢失 类似Overrun 
     CAN_MSG->CTL.BIT.DATA_LOST = 1;            //报文丢失标志 
*/
    if(usMsgCtrl & CAN_IF1MCTL_NEWDAT)              //判断是否有新数据
     {                                              //有新数据
      CAN_MSG->CTL.BIT.LEN = (usMsgCtrl & CAN_IF1MCTL_DLC_M);//数据长度
//      if(CAN_MSG->CTL.BIT.RMT_FRM == 0)
       {                                            //不为远程帧 
        CANDataRegRead(IntNumber,					          //读CAN数据寄存器 中断号
                         &CAN_MSG->Data.BYTE[0],	//保存数据指针
                         (u32)&CANx->INF[1].DA1,		//CAN数据寄存器地址
                         CAN_MSG->CTL.BIT.LEN);	//数据长度
       }
/*       
      CANRegWrite((u32)&CANx->INF[1].CMSK , CAN_IF1CMSK_NEWDAT);//清除新数据标志
      CANRegWrite((u32)&CANx->INF[1].CRQ , (CAN_MSG->CTL.BIT.IDx & CAN_IF1CRQ_MNUM_M));
      while(CANRegRead(IntNumber,(u32)&CANx->INF[1].CRQ) & CAN_IF1CRQ_BUSY)
       {              //等待写操作完成
       }
      CAN_MSG->CTL.BIT.NEW_DATA = 1;              //置位有新数据标志  
*/
     }
    else                                             //没有数据
     CAN_MSG->CTL.BIT.LEN = 0;                    //数据长度0 
}
/*****************************************************************************
* 清除 CAN 报文RAM 区 报文对象
* 入口:CANx CAN结构体
* 入口: ulObjID 报文编号
*****************************************************************************/
void CANMessageClear(CAN_Typedef *CANx, u32 ulObjID)
{
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((ulObjID >= 1) && (ulObjID <= 32));
    while(CANRegRead(IntNumber,(u32)&CANx->INF[0].CRQ) & CAN_IF1CRQ_BUSY)
     {             //等待接口寄存器组完成
     }
    CANRegWrite((u32)&CANx->INF[0].CMSK , (CAN_IF1CMSK_WRNRD | //写 INF->MSG RAM
                                           CAN_IF1CMSK_ARB));  //传送 ARB仲裁位
    CANRegWrite((u32)&CANx->INF[0].ARB1 , 0);                  // 
    CANRegWrite((u32)&CANx->INF[0].ARB2 , 0);                  //  
    CANRegWrite((u32)&CANx->INF[0].CRQ , (ulObjID & CAN_IF1CRQ_MNUM_M));
}
/*****************************************************************************
* 清除 报文发送
* 入口:CANx CAN结构体
* 入口: ulObjID 报文编号
*****************************************************************************/
void CAN_MSG_TX_CANCEL(CAN_Typedef *CANx, u32 ulObjID)
{
    u32 usMsgCtrl =	 CAN_IF1MCTL_EOB;                          //清除Txrqst 标志
    u32 IntNumber = CANIntNumberGet(CANx);
    ASSERT(CANBaseValid(CANx));
    ASSERT((ulObjID >= 1) && (ulObjID <= 32));
    while(CANRegRead(IntNumber,(u32)&CANx->INF[0].CRQ) & CAN_IF1CRQ_BUSY)
     {             //等待接口寄存器组完成
     }
    CANRegWrite((u32)&CANx->INF[0].CMSK , (CAN_IF1CMSK_WRNRD | //写 INF->MSG RAM
                                           CAN_IF1CMSK_CONTROL|
										   CAN_IF1CMSK_CLRINTPND));//访问控制位
    CANRegWrite((u32)&CANx->INF[0].MCTL , usMsgCtrl);          //写报文控制寄存器
    CANRegWrite((u32)&CANx->INF[0].CRQ , (ulObjID & CAN_IF1CRQ_MNUM_M));
    while(CANRegRead(IntNumber,(u32)&CANx->INF[0].CRQ) & CAN_IF1CRQ_BUSY)
     {             //等待接口寄存器组完成
     }
}
